/* 
«ј¬ƒјЌЌя 1

п≥сл€ кожноњ ≥терац≥њ х буде зб≥льшуватись на один до тих п≥р поки не буде дор≥внювати 100


«ј¬ƒјЌЌя 2

int main() {
    int arr[10][10];
    for (int x = 0; x < 10; x++) {
        for (int y = 0; y < 10; y++) {
            arr[x][y] = 0; }


«ј¬ƒјЌЌя 3

            int main() {
    for (int i = 100; i <= 200; i += 2) {
        std::cout << i << " ";
    }
    std::cout << std::endl;
    return 0; }


«ј¬ƒјЌЌя 4

   int i = 100;
    while (i <= 200) {
        std::cout << i << " ";
        i += 2;
    }
    std::cout << std::endl;


«ј¬ƒјЌЌя 5

int main() {
    int i = 100;
    do {
        std::cout << i << " ";
        i += 2;
    } while (i <= 200);
    std::cout << std::endl;


«ј¬ƒјЌЌя 6

- орфограф≥чна помилка у слов≥ каунтер
- не вистачаЇ крапки з комою п≥сл€ строки виводу
- потр≥бно п≥дключити б≥бл≥отеку стд дл€ коректного виводу (п≥дключити саму б≥бл≥отеку)


«ј¬ƒјЌЌя 7

- ; потр≥бна перед л≥чильником що в дужках


«ј¬ƒјЌЌя 8

умова не виконуЇтьс€ одразу, отже або потр≥бно виправти значечнн€ ≥нта або використати ≥ншу конструкц≥ю цикла ду вайл

*/